Changing the type of a subwall is not allowed. Edit the stacked wall type instead.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CannotChangeSubwall { get; }
  Visual Basic
Public Shared ReadOnly Property CannotChangeSubwall As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CannotChangeSubwall {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures WallFailures Class
  Autodesk.Revit.DB Namespace